<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Reading...
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]
module.operations_engineering_topic.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]
module.levgorbunov1_cancel_workflow_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]
module.unauthorised_users_modify_repository_settings_alarm.data.aws_cloudwatch_log_group.github_events_log_group: Read complete after 0s [id=/aws/lambda/GitHubIngestFunction]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.sfn_policy will be created
  + resource "aws_iam_policy" "sfn_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "step-functions-logs-query-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:StartQuery",
                          + "logs:GetQueryResults",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.sfn_execution_role will be created
  + resource "aws_iam_role" "sfn_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "step-functions-logs-query-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.sfn_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "sfn_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "step-functions-logs-query-role"
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_event_rule.default will be created
  + resource "aws_cloudwatch_event_rule" "default" {
      + arn            = (known after apply)
      + description    = "EventBridge rule to capture CloudWatch alarm state changes"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = {
                      + value = [
                          + "ALARM",
                        ]
                    }
                }
              + detail-type = [
                  + "CloudWatch Alarm State Change ",
                ]
              + source      = [
                  + "aws.cloudwatch",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "alarm-state-change-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.default will be created
  + resource "aws_cloudwatch_log_metric_filter" "default" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "Levgorbunov1CancelWorkflowEvents"
      + pattern        = "{ ($.userIdentity.principalId = \"levgorbunov1\") && ($.eventName = \"workflows.cancel_workflow_run\") }"

      + metric_transformation {
          + name      = "Levgorbunov1CancelWorkflowEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      - id             = "Levgorbunov1CancelWorkflowEvents" -> null
      - log_group_name = "/aws/lambda/GitHubIngestFunction" -> null
      - name           = "Levgorbunov1CancelWorkflowEvents" -> null
      - pattern        = "{ ($.userIdentity.principalId = \"levgorbunov1\") && ($.eventName = \"workflows.cancel_workflow_run\") }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "Levgorbunov1CancelWorkflowEvents" -> null
          - namespace  = "GitHubMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.default will be created
  + resource "aws_cloudwatch_metric_alarm" "default" {
      + actions_enabled                       = true
      + alarm_description                     = "Alarm for when user levgorbunov1 cancels any GitHub Actions workflow"
      + alarm_name                            = "Levgorbunov1CancelWorkflowEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Levgorbunov1CancelWorkflowEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts",
        ] -> null
      - alarm_description         = "Alarm for when user levgorbunov1 cancels any GitHub Actions workflow" -> null
      - alarm_name                = "Levgorbunov1CancelWorkflowEventsAlarm" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:880656497252:alarm:Levgorbunov1CancelWorkflowEventsAlarm" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "Levgorbunov1CancelWorkflowEventsAlarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "Levgorbunov1CancelWorkflowEvents" -> null
      - namespace                 = "GitHubMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.operations_engineering_topic.aws_sns_topic.default will be created
  + resource "aws_sns_topic" "default" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "operations-engineering-github-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.operations_engineering_topic.aws_sns_topic.sns_topic will be destroyed
  # (because aws_sns_topic.sns_topic is not in configuration)
  - resource "aws_sns_topic" "sns_topic" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "operations-engineering-github-alerts" -> null
      - owner                                    = "880656497252" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "880656497252"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # module.operations_engineering_topic.aws_sns_topic_subscription.default["lev.gorbunov@digital.justice.gov.uk"] will be created
  + resource "aws_sns_topic_subscription" "default" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "lev.gorbunov@digital.justice.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.operations_engineering_topic.aws_sns_topic_subscription.email_subscription["lev.gorbunov@digital.justice.gov.uk"] will be destroyed
  # (because aws_sns_topic_subscription.email_subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "email_subscription" {
      - arn                             = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "lev.gorbunov@digital.justice.gov.uk" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:27741290-2203-45ed-8cd0-9982d078f215" -> null
      - owner_id                        = "880656497252" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "email" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts" -> null
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_event_rule.default will be created
  + resource "aws_cloudwatch_event_rule" "default" {
      + arn            = (known after apply)
      + description    = "EventBridge rule to capture CloudWatch alarm state changes"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = {
                      + value = [
                          + "ALARM",
                        ]
                    }
                }
              + detail-type = [
                  + "CloudWatch Alarm State Change ",
                ]
              + source      = [
                  + "aws.cloudwatch",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "alarm-state-change-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.default will be created
  + resource "aws_cloudwatch_log_metric_filter" "default" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/GitHubIngestFunction"
      + name           = "UnathorisedUsersModifyRepositorySettingsEvents"
      + pattern        = "{ ($.userIdentity.principalId != \"testuser1\") && ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/operations-engineering-github-cloudwatch-alarms\") }"

      + metric_transformation {
          + name      = "UnathorisedUsersModifyRepositorySettingsEvents"
          + namespace = "GitHubMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.levgorbunov1_cancel_workflow_filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "levgorbunov1_cancel_workflow_filter" {
      - id             = "UnathorisedUsersModifyRepositorySettingsEvents" -> null
      - log_group_name = "/aws/lambda/GitHubIngestFunction" -> null
      - name           = "UnathorisedUsersModifyRepositorySettingsEvents" -> null
      - pattern        = "{ ($.userIdentity.principalId != \"testuser1\") && ($.eventName = \"repo.access\" || $.eventName = \"repo.add_member\" || $.eventName = \"repo.change_merge_setting\") && ($.userIdentity.details.Repository = \"ministryofjustice/operations-engineering-github-cloudwatch-alarms\") }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "UnathorisedUsersModifyRepositorySettingsEvents" -> null
          - namespace  = "GitHubMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.default will be created
  + resource "aws_cloudwatch_metric_alarm" "default" {
      + actions_enabled                       = true
      + alarm_description                     = "Alarm for when any user other than testuser1 modifies the settings of ministryofjustice/operations-engineering-github-cloudwatch-alarms repository"
      + alarm_name                            = "UnathorisedUsersModifyRepositorySettingsEventsAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnathorisedUsersModifyRepositorySettingsEvents"
      + namespace                             = "GitHubMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.levgorbunov1_cancel_workflow_alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "levgorbunov1_cancel_workflow_alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts",
        ] -> null
      - alarm_description         = "Alarm for when any user other than testuser1 modifies the settings of ministryofjustice/operations-engineering-github-cloudwatch-alarms repository" -> null
      - alarm_name                = "UnathorisedUsersModifyRepositorySettingsEventsAlarm" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:880656497252:alarm:UnathorisedUsersModifyRepositorySettingsEventsAlarm" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "UnathorisedUsersModifyRepositorySettingsEventsAlarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "UnathorisedUsersModifyRepositorySettingsEvents" -> null
      - namespace                 = "GitHubMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "missing" -> null
    }

Plan: 11 to add, 0 to change, 6 to destroy.

```